apache/nuttx/arch/arm/src/tlsr82/tlsr82_adc.c
/****************************************************************************
 * arch/arm/src/tlsr82/tlsr82_adc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <sys/param.h>
#include <assert.h>
#include <nuttx/debug.h>

#include <nuttx/analog/adc.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/mutex.h>
#include <arch/board/board.h>

#include "tlsr82_adc.h"
#include "tlsr82_gpio.h"
#include "tlsr82_analog.h"
#include "tlsr82_flash.h"
#include "tlsr82_timer.h"
#include "hardware/tlsr82_dfifo.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Default reference voltage 1175 mV */

#define ADC_DEFAULT_VREF     1175

#define ADC_FILT_NUM         CONFIG_TLSR82_ADC_FILT_NUM

#if (ADC_FILT_NUM & 0x3) != 0
#  error "The filter number must be multiple of 4 !"
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* ADC Information data */

struct adc_info_s
{
  uint32_t   base_vref;    /* The reference voltage (mV) or gain for base/gpio mode */
  int        base_off;     /* The offset for base/gpio mode two-point calibration */
  uint32_t   vbat_vref;    /* The reference voltage (mV) for vbat mode */
  bool       base_two;     /* Base/Gpio mode two-point calibration or not */
  bool       registered;   /* Have registered a adc device */
  bool       configured;   /* Adc has been configured or not */
  uint8_t    channel;      /* Adc current channel */
  uint8_t    channeltype;  /* Adc current channel type */
};

/* ADC Private Data */

struct adc_chan_s
{
  uint32_t                     ref;          /* Reference count */
  struct adc_info_s           *info;         /* Adc information */
  const uint8_t                channeltype;  /* Channel number */
  const uint8_t                channel;      /* Channel number */
  const uint32_t               pinset;       /* GPIO pin number */
  const struct adc_callback_s *cb;           /* Upper driver callback */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void tlsr82_adc_reset(void);
static void tlsr82_adc_power_ctrl(bool enable);
static void tlsr82_adc_clk_ctrl(bool enable);
static void tlsr82_adc_config(struct adc_chan_s *priv);
static void tlsr82_adc_pin_config(uint32_t pinset);
static void tlsr82_adc_chan_config(uint32_t pinset);

static void adc_dump(const char *msg);
static int  adc_bind(struct adc_dev_s *dev,
                     const struct adc_callback_s *callback);
static void adc_reset(struct adc_dev_s *dev);
static int  adc_setup(struct adc_dev_s *dev);
static void adc_shutdown(struct adc_dev_s *dev);
static void adc_rxint(struct adc_dev_s *dev, bool enable);
static int  adc_ioctl(struct adc_dev_s *dev, int cmd, unsigned long arg);
static void adc_read_work(struct adc_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* ADC module information */

static struct adc_info_s g_adc_module0_info =
{
  .base_vref    = ADC_DEFAULT_VREF,
  .base_off     = 0,
  .vbat_vref    = ADC_DEFAULT_VREF,
  .base_two     = false,
  .registered   = false,
  .configured   = false,
  .channel      = ADC_CHAN_NONE,
  .channeltype  = ADC_CHAN_TYPE_NONE,
};

/* ADC interface operations */

static const struct adc_ops_s g_adcops =
{
  .ao_bind        = adc_bind,
  .ao_reset       = adc_reset,
  .ao_setup       = adc_setup,
  .ao_shutdown    = adc_shutdown,
  .ao_rxint       = adc_rxint,
  .ao_ioctl       = adc_ioctl,
};

/* ADC normal channel, for gpio sample */

#ifdef CONFIG_TLSR82_ADC_CHAN0
static struct adc_chan_s g_adc_chan0 =
{
  .info        = &g_adc_module0_info,
  .channeltype = BOARD_ADC0_CHAN_TYPE,
  .channel     = BOARD_ADC0_CHAN,
  .pinset      = BOARD_ADC0_PIN,
};

static struct adc_dev_s g_adc_chan0_dev =
{
  .ad_ops  = &g_adcops,
  .ad_priv = &g_adc_chan0,
};
#endif

#ifdef CONFIG_TLSR82_ADC_CHAN1
static struct adc_chan_s g_adc_chan1 =
{
  .info        = &g_adc_module0_info,
  .channeltype = BOARD_ADC1_CHAN_TYPE,
  .channel     = BOARD_ADC1_CHAN,
  .pinset      = BOARD_ADC1_PIN,
};

static struct adc_dev_s g_adc_chan1_dev =
{
  .ad_ops  = &g_adcops,
  .ad_priv = &g_adc_chan1,
};
#endif

#ifdef CONFIG_TLSR82_ADC_CHAN2
static struct adc_chan_s g_adc_chan2 =
{
  .info        = &g_adc_module0_info,
  .channeltype = BOARD_ADC2_CHAN_TYPE,
  .channel     = BOARD_ADC2_CHAN,
  .pinset      = BOARD_ADC2_PIN,
};

static struct adc_dev_s g_adc_chan2_dev =
{
  .ad_ops  = &g_adcops,
  .ad_priv = &g_adc_chan2,
};
#endif

/* ADC Bat channel, for chip battery sample */

#ifdef CONFIG_TLSR82_ADC_VBAT
static struct adc_chan_s g_adc_chanbat =
{
  .info        = &g_adc_module0_info,
  .channeltype = BOARD_ADCVBAT_CHAN_TYPE,
  .channel     = BOARD_ADCVBAT_CHAN,
  .pinset      = BOARD_ADCVBAT_PIN,
};

static struct adc_dev_s g_adc_chanbat_dev =
{
  .ad_ops  = &g_adcops,
  .ad_priv = &g_adc_chanbat,
};
#endif

