apache/nuttx/arch/arm/src/tlsr82/tlsr82_adc.c
static mutex_t g_lock = NXMUTEX_INITIALIZER;

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tlsr82_adc_dfifo_enable
 *
 * Description:
 *   Enable the adc dfifo/dfifo2, the dfifo2 will copy the adc sample data
 *   to the address in DFIFO_ADC_ADDR_REG.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void tlsr82_adc_dfifo_enable(void)
{
  DFIFO_MODE_REG |= DFIFO_MODE_DFIFO2_IN;
}

/****************************************************************************
 * Name: tlsr82_adc_dfifo_disable
 *
 * Description:
 *   Disable the adc dfifo/dfifo2
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void tlsr82_adc_dfifo_disable(void)
{
  DFIFO_MODE_REG &= ~DFIFO_MODE_DFIFO2_IN;
}

/****************************************************************************
 * Name: tlsr82_adc_dfifo_config
 *
 * Description:
 *   Config the data buffer, so DFIFO2 can copy sample value to buffer
 *
 * Input Parameters:
 *   buffer - the buffer to store the adc sample data
 *   size   - the buffer size, this size must be multiple of 4
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void tlsr82_adc_dfifo_config(uint8_t *buffer, size_t size)
{
  /* Config the data buffer, so DFIFO2 can copy sample value to buffer
   * DFIFO buffer address : only need low 16 bit, because the high 16 bit
   *                        must be 0x0084
   * DFIFO buffer size    : DFIFO_ADC_SIZE_REG = n ==> 4 * (n + 1) size
   *                        DFIFO_ADC_SIZE_REG = size / 4 - 1
   */

  DFIFO_ADC_ADDR_REG = (uint16_t)((uint32_t)buffer & 0xffff);
  DFIFO_ADC_SIZE_REG = (size >> 2) - 1;

  /* Clear the dfifo write pointer */

  DFIFO2_WPTR_REG    = 0;
}

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tlsr82_adc_reset
 *
 * Description:
 *   Reset the adc, reconfig the adc.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tlsr82_adc_reset(void)
{
  BM_SET(RESET_RST1_REG, RESET_RST1_ADC);
  BM_CLR(RESET_RST1_REG, RESET_RST1_ADC);
}

/****************************************************************************
 * Name: tlsr82_adc_power_ctrl
 *
 * Description:
 *   Enable/Disable the ADC power, the power should be power up before
 *   config the adc.
 *
 * Input Parameters:
 *   enable  -  true : power up
 *              false: power down
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tlsr82_adc_power_ctrl(bool enable)
{
  tlsr82_analog_write(ADC_PAG_CTRL_REG,
                      (tlsr82_analog_read(ADC_PAG_CTRL_REG) &
                       (~ADC_POWER_MASK)) |
                      (!enable) << ADC_POWER_SHIFT);
}

/****************************************************************************
 * Name: tlsr82_adc_clk_ctrl
 *
 * Description:
 *   Enable/Disable the ADC clock.
 *
 * Input Parameters:
 *   enable  -  true : enable adc clock
 *              false: disable adc clock
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tlsr82_adc_clk_ctrl(bool enable)
{
  if (enable)
    {
      tlsr82_analog_write(ADC_CLK_REG,
                          tlsr82_analog_read(ADC_CLK_REG) |
                          ADC_CLK_24M_EN);
    }
  else
    {
      tlsr82_analog_write(ADC_CLK_REG,
                          tlsr82_analog_read(ADC_CLK_REG) &
                          (~ADC_CLK_24M_EN));
    }
}

/****************************************************************************
 * Name: tlsr82_adc_config
 *
 * Description:
 *   Config the adc to different mode, after this, the adc can start sample
 *   the voltage in the gpio pin (Base mode) or the chip voltage (Vbat
 *   channel mode).
 *   Five configuration conditions:
 *   1. Same channel, do not need do not need re-configuration;
 *   2. adc module has not been configured, must configure it;
 *   3. adc module has been configured, but current channel and configured
 *      channel are both vbat channel, do not need re-configuration;
 *   4. adc module has been configured, but current channel and configured
 *      channel are both base channel, only configure the channel;
 *   5. others, need re-configuration.
 *
 * Input Parameters:
 *   priv  - adc channel handler
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void tlsr82_adc_config(struct adc_chan_s *priv)
{
  uint8_t channel     = priv->info->channel;
  uint8_t channeltype = priv->info->channeltype;

  ainfo("Current channel=%u, channeltype=%u\n", channel, channeltype);
  ainfo("Input   channel=%u, channeltype=%u\n",
        priv->channel, priv->channeltype);

  DEBUGASSERT(priv != NULL && priv->channel != ADC_CHAN_NONE);

  /* If current channel type is same as the priv channel type, do not
   * need re-configure all the register.
   */

  if (channeltype == priv->channeltype)
    {
      if (channeltype == ADC_CHAN_TYPE_BASE && channel != priv->channel)
        {
          /* The channel type is base and the input channel (GPIO pin) is
           * different, only need re-configure the adc input channel.
           */

          tlsr82_adc_chan_config(priv->pinset);
          priv->info->channel = priv->channel;
        }

      return;
    }

