apache/nuttx/arch/arm/src/tlsr82/tlsr82_adc.c
static uint16_t adc_read(void)
{
  volatile uint16_t data_buf[ADC_FILT_NUM];
  uint16_t tmp;
  uint16_t max = 0;
  uint16_t min = UINT16_MAX;
  uint32_t sum = 0;
  uint32_t currtime;
  int i;

  /* Clear the data buffer and config */

  memset((void *)data_buf, 0, ADC_FILT_NUM);

  tlsr82_adc_dfifo_config((uint8_t *)data_buf, ADC_FILT_NUM);

  /* Enable DFIFO 2 */

  tlsr82_adc_dfifo_enable();

  /* Wait at least 2 sample cycle, frequency = 96k, T = 10.4us */

  currtime = tlsr82_time();
  while (!tlsr82_time_exceed(currtime, 25));

  for (i = 0; i < ADC_FILT_NUM; i++)
    {
      while (data_buf[i] == 0 && !tlsr82_time_exceed(currtime, 25));
      currtime = tlsr82_time();

      /* Bit13 is the sign bit, bit13 = 1 indicates the data
       * is negative but we only get the low 13bit data.
       */

      tmp = data_buf[i];
      if (tmp & BIT(13))
        {
          tmp = 0;
        }
      else
        {
          tmp &= 0x1fff;
        }

      sum += tmp;

      if (tmp > max)
        {
          max = tmp;
        }

      if (tmp < min)
        {
          min = tmp;
        }

      ainfo("data_buf[%d]=%u\n", i, tmp);
    }

  /* Disable DFIFO 2 */

  tlsr82_adc_dfifo_disable();

  ainfo("sum=%lu, max=%u, min=%u, filt_num=%d\n",
        sum, max, min, ADC_FILT_NUM);

  /* Remove max, min value and get the average value */

  tmp = (sum - min - max) / (ADC_FILT_NUM - 2);

  return tmp;
}

/****************************************************************************
 * Name: tlsr82_adc_calibrate
 *
 * Description:
 *   ADC calibration.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

#ifdef CONFIG_TLSR82_ADC_CALI
static void tlsr82_adc_calibrate(struct adc_chan_s *priv)
{
  uint8_t cali_data[7];

  uint32_t base_vref;
  uint32_t vbat_vref;

  memset((void *)cali_data, 0, sizeof(cali_data));
  tlsr82_flash_read_data(CONFIG_TLSR82_ADC_CALI_PARA_ADDR, cali_data,
                         sizeof(cali_data));

  ainfo("Calibration data: 0x%x 0x%x 0x%x 0x%x 0x%x 0x%x 0x%x\n",
        cali_data[0], cali_data[1], cali_data[2], cali_data[3],
        cali_data[4], cali_data[5], cali_data[6]);

  /* Calibration parameters format follow the telink sdk code */

  /* Base/gpio mode calibration parameters read */

  if (cali_data[4] <= 0x7f && cali_data[5] != 0xff &&
      cali_data[6] != 0xff)
    {
      /* Two-point calibration exist, the base_vref as the gain to use
       * Method of calculating two-point gpio calibration Flash_gain
       * and Flash_offset:
       * gain   = (data[6] << 8) + data[5] + 1000 mv
       * offset = data[4] - 20 mv
       */

      priv->info->base_vref = (cali_data[6] << 8) + cali_data[5] + 1000;
      priv->info->base_off  = (int)cali_data[4] - 20;
      priv->info->base_two  = true;
    }
  else
    {
      /* One-point calibration exist
       * Method of calculating calibration Flash_gpio_vref value:
       * vref = 1175 + data[0] - 255 + data[1] mV
       *      = 920 + data[0] + data[1] mV
       */

      base_vref = 920 + cali_data[0] + cali_data[1];
      if (base_vref >= 1047 && base_vref <= 1302)
        {
          priv->info->base_vref = base_vref;
        }

      priv->info->base_two = false;
    }

  /* Vbat mode calibration parameters read */

  if (cali_data[2] != 0xff || cali_data[3] != 0xff)
    {
      /* One-point calibration exist
       * Method of calculating calibration Flash_vbat_vref value:
       * vref = 1175 + data[2] - 255 + data[3] mV
       *      = 920 + data[2] + data[3] mV
       */

      vbat_vref = 920 + cali_data[2] + cali_data[3];
      if (vbat_vref >= 1047 && vbat_vref <= 1302)
        {
          priv->info->vbat_vref = vbat_vref;
        }
    }

    ainfo("Calibration parameters:\n");
    ainfo("  base two-point: gain=%d, offset=%d\n",
          priv->info->base_vref, priv->info->base_off);
    ainfo("  base one-point: vref=%lu\n", priv->info->base_vref);
    ainfo("  vbat one-point: vref=%lu\n", priv->info->vbat_vref);
}
#endif

/****************************************************************************
 * Name: adc_read_work
 *
 * Description:
 *   Read ADC value and pass it to up.
 *
 * Input Parameters:
 *   dev - ADC device pointer
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void adc_read_work(struct adc_dev_s *dev)
{
  int ret;
  uint32_t value;
  int32_t adc;
  struct adc_chan_s *priv = (struct adc_chan_s *)dev->ad_priv;

  ret = nxmutex_lock(&g_lock);
  if (ret < 0)
    {
      aerr("Failed to wait sem ret=%d\n", ret);
      return;
    }

  /* Config the adc */

  tlsr82_adc_config(priv);

  /* Dump adc register for debug */

  adc_dump("adc_read_work");

  value = adc_read();

  /* Transfer the adc count into voltage (mV)
   * ADC resolution is 14bit, bit13 is a signed bit and we set the
   * negative input be gnd, so the actual adc resolution is 13bit.
   */

#ifdef CONFIG_TLSR82_ADC_VBAT
  if (priv->channeltype == ADC_CHAN_TYPE_VBAT)
    {
      /* Vbat channel mode, divider = 1/3, scale = 1 ==> factor = 3 */

      adc = (value * priv->info->vbat_vref * 3) >> 13;
    }
  else
#endif
    {
      /* Base/gpio mode, divider = 1, scale = 1/8 ==> factor = 8 */

      adc = (value * priv->info->base_vref * 8) >> 13;

      if (priv->info->base_two)
        {
          adc += priv->info->base_off;
        }
    }

  /* Put adc value to the adc buffer */

  priv->cb->au_receive(dev, priv->channel, adc);

  ainfo("channel: %" PRIu8 ", voltage: %" PRIu32 " mV\n", priv->channel,
        adc);

  nxmutex_unlock(&g_lock);
}

/****************************************************************************
 * Name: adc_bind
 *
 * Description:
 *   Bind the upper-half driver callbacks to the lower-half implementation.
 *   This must be called early in order to receive ADC event notifications.
 *
 ****************************************************************************/

static int adc_bind(struct adc_dev_s *dev,
                    const struct adc_callback_s *callback)
{
  struct adc_chan_s *priv = (struct adc_chan_s *)dev->ad_priv;

  DEBUGASSERT(priv != NULL);

